//-----------------------------------------------------------------------------
// @brief  カメラクラス.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------
//#include "EffekseerForDXLib.h"
#include "Player.h"
#include "BackGroundObject.h"
#include "Camera.h"
#include "Enemy.h"
#include "Map.h"

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
Camera::Camera()
{
	// 描画範囲の設定
	SetCameraNearFar(0.1f, 1500.0f);

	// カメラのポジション
	pos = VGet(-7, 5, -22);

	//(0,10,-20)の視点から(0,10,0)のターゲットを見る角度にカメラを設置
	//SetCameraPositionAndTarget_UpVecY(VGet(0, 10, -20), VGet(0.0f, 10.0f, 200.0f));

	// 視野角の設定
	//SetupCamera_Perspective(90 * DX_PI_F / 180.0f);

	// Effekseerのカメラと同期する
	//Effekseer_Sync3DSetting();
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
Camera::~Camera()
{
	// 処理なし.
}

//-----------------------------------------------------------------------------
// @brief  更新.
//-----------------------------------------------------------------------------
void Camera::Update(Player& player)
{
	// カメラを設定
	SetCameraPositionAndTarget_UpVecY(pos, VGet(-7, 5, 20));
}